#define _CRT_SECURE_NO_WARNINGS
#include <windows.h>
#include <stdio.h>



int main(void) {
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	char name1[9] = "Алюминий", name2[11] = "Стекловата", name3[6] = "Глина";
	char sc1 = 'М', sc2 = 'Т', sc3 = 'Д';
	char cnt1[6] = "0-100", cnt2[6] = "0-100", cnt3[6] = "15-20";
	double sq1 = 209.3, sq2 = 0.035, sq3 = 0.73;
	/* Введение фактических данных*/
	/*printf("1. Введите: вещество, тип, влажность, коеффициент >");
	scanf("%s %c %hu %lf", name1, &sc1, &cnt1, &sq1);
	printf("2. Введите: вещество, тип, влажность, коеффициент >");
	scanf("%s %c %hu %lf", name2, &sc2, &cnt2, &sq2);
	printf("3. Введите: вещество, тип, влажность, коеффициент >");
	scanf("%s %c %hu %lf", name3, &sc3, &cnt3, &sq3);*/
	/* Вывод таблицы */
	/* вывод заголовков */
	printf("---------------------------------------------------\n");
	printf("|   Коэффициенты теплопроводимости материаллов    |\n");
	printf("|-------------------------------------------------|\n");
	printf("| Вещество    | Тип | Влажность (%%)  | Коэффициент|\n");
	printf("|             |     |                |            |\n");
	printf("|-------------|-----|----------------|------------|\n");
	/* вывод строк фактических данных */
	printf("| %11s | %-3c | %-14s | %-10.1lf |\n", name1, sc1, cnt1, sq1);
	printf("| %11s | %-3c | %-14s | %-10.3lf |\n", name2, sc2, cnt2, sq2);
	printf("| %11s | %-3c | %-14s | %-10.2lf |\n", name3, sc3, cnt3, sq3);
	/* вывод примечаний */
	printf("|-------------------------------------------------|\n");
	printf("|  Примечание: М - металлы,                       |\n");
	printf("|              Т - термоизоляционные материалы,   |\n");
	printf("|              Д - другие материалы               |\n");
	printf("---------------------------------------------------\n");
	return 0;
}